// `for` е едиствения начин в Go за извършване на
// повтарящи се действия[^loop]. Ето няколко основни
// видове повторения.
// [^loop]: loop - цикъл, итерация, повторение

package main

import "fmt"

func main() {

	// Най-основния вид е с едно единствено условие.
	i := 1
	for i <= 3 {
		fmt.Println(i)
		i = i + 1
	}

	// Класическо повторение с начално действие; условие; последващо
	// действие.
	for j := 0; j < 3; j++ {
		fmt.Println(j)
	}

	// Друг начин за постигане на основното действие
	// „прави това N пъти” е `range` (порядък, поредност)
	// от действия чрез цяло число.
	for i := range 3 {
		fmt.Println("range", i)
	}

	// `for` без условие ще повтаря безкрайно действието
	// между фигурните скоби, докато не прекъснете
	// действието чрез `break` или излезете от обгръщащата
	// функция чрез `return`.
	for {
		fmt.Println("loop")
		break
	}

	// Също можете да продължите чрез `continue` към
	// следващото действие, без да сте завършили текущото.
	for n := range 6 {
		if n%2 == 0 {
			continue
		}
		fmt.Println(n)
	}
}
