// Го поддържа _указатели_[^pointers]. Това ви позволява
// да подавате препратки[^reference] към стойности и записи във вашата
// програма.
// [^pointers]: pointer – указател, https://bg.wikipedia.org/wiki/Указател_(програмиране) . „Указателите са просто числа, указващи мястото на дадена стойност в паметта, и това е начинът, по който Го препраща към обекти.“ – https://go.dev/blog/greenteagc .
// [^reference]: reference – препратка; препращам към, реферирам

package main

import "fmt"

// Ще покажем по какво се различават указателите от
// стойностите с две функции: `zeroval` и `zeroptr`.
// `zeroval` приема една стойност от вида `int`. `zeroval`
// ще приеме копие на `ival`, отделна стойност от тази,
// която е в извикващата функция.
func zeroval(ival int) {
	ival = 0
}

// `zeroptr`, напротив, приема като податка `*int`. Сиреч,
// указател към някаква стойност от вида `int`. След това,
// като напишем `*iptr` в тялото на функцията, _достъпваме
// пряко_[^dereference] стойността, чието
// местонахождение (адрес) в паметта съдържа указателят с
// име `iptr`. Присвоявайки нова стойност на пряко
// достъпената стойност `*iptr`, променяме направо нея, а
// не адреса, който иначе указателят съдържа.
// [^dereference]: dereference – достъпвам пряко, получавам пряк достъп до указваната стойност
func zeroptr(iptr *int) {
	*iptr = 0
}

func main() {
	i := 1
	fmt.Println("начална стойност на i:", i)

	zeroval(i)
	fmt.Println("zeroval:", i)

	// Като напишем `&i`, получваме адреса на `i` в паметта, сиреч, указателя към `i`.
	zeroptr(&i)
	fmt.Println("zeroptr:", i)

	// Указателите също могат да бъдат отпечатвани.
	fmt.Println("указател към i – &i:", &i)
}
