// Изпитанията за правилност на работата на отделните единици код (unit testing)
// е важна част от писането на програми, подчинени на определени правила.
// Пакетът `testing` предоставя нужните пособия за писане на единични
// изпитания[^ut], а с командата `go test` изпълняваме тестовете.
// [^ut]: unit tests – изпитания на единици (програмен код). Единиците обикновено са функциите в даден пакет или методи към структура.

// За целите на това показно̀ програмният код се намира в пакета `main`, но това
// би могъл да бъде всеки пакет. Изпитващият програмен код (тестовете)
// обикновено се намира в същия пакет, който бива изпитан дали работи
// правилно.
package main

import (
	"fmt"
	"testing"
)

// Ще изпитаме това просто осъществяване на проверка за по-малкото от две цели
// числа. Обикновено код като този би се намирал във файл с име, да речем
// `intutils.go`,  а файла с изпитанията – в `intutils_test.go`
func IntMin(a, b int) int {
	if a < b {
		return a
	}
	return b
}

// Изпитанието се състои в написване на изпитваща функция, чието име
// задължително започва с `Test`.
func TestIntMinBasic(t *testing.T) {
	ans := IntMin(2, -2)
	if ans != -2 {
		// Методите с имена, започващи с `t.Error*` докладват провалените
		// единични изпитания, но продължават изпълнението на файла с изпитанията.
		// А тези, започващи с `t.Fatal*` докладват и спират изпълнението
		// незабавно.
		t.Errorf("IntMin(2, -2) = %d; want -2", ans)
	}
}

// Писането на изпитания предполага много повторение на почти един и същи код,
// затова е прието да се пишат т.нар. *таблични изпитания*, където входните
// данни и очакваните изходни данни биват описани в таблица и чрез повторение
// таблицата бива обходена, за да се изпълни изпитваната единица с всяко
// съчетание от входни данни, и да се сравнят изходните данни, получени при
// изпълнението с очакваните, описани в таблицата.
func TestIntMinTableDriven(t *testing.T) {
	var tests = []struct {
		a, b     int
		очаквано int
	}{
		{0, 1, 0},
		{1, 0, 0},
		{2, -2, -2},
		{0, -1, -1},
		{-1, 0, -1},
	}

	for _, tt := range tests {

		// Чрез `t.Run` изпълняваме „подизпитания” – по едно за всеки ред от таблицата.
		// Те се извеждат на екрана пѡтделно, когато пуснем изпитанията с командата `go
		// test -v`.
		testname := fmt.Sprintf("%d,%d", tt.a, tt.b)
		t.Run(testname, func(t *testing.T) {
			получено := IntMin(tt.a, tt.b)
			if получено != tt.очаквано {
				t.Errorf("получено %d, очаквано %d",
					получено, tt.очаквано)
			}
		})
	}
}

// Изпитанията за бързодействие също се намират във файлове с имена
// `*_test.go`, където `*` се замества с името на пакета. Имената на тези
// изпитания трябва да започват с `Benchmark`. Програмният код, който е нужен,
// за да се подготви изпитанието за бързодействие, но не трябва да влиза в
// изпитанието, се пише извън повторението `b.Loop()`.
func BenchmarkIntMin(b *testing.B) {
	for b.Loop() {

		// Изпълнителят на изпитанието ще изпълни автоматично тялото на
		// повторението многократно, за да направи оценка на бързодействието на
		// отделното извикване.
		IntMin(1, 2)
	}
}
