# Като пуснем програмата, виждаме, че тя изчислява хеша и го показва в четим за
# човек шестнадесетичен вид.
$ go run sha256-hashes.go
sha256 this string
      1af1dfa857bf1d8814fe1af8983c18080019922e557f15a8a0d3d…
7072651af1dfa857bf1d8814fe1af8983c18080019922e557f15a8a0d3d…


# Можете да изчислите и други видове хешове, ползващи подобен на използвания
# по-горе подход. Например, за да използвате SHA512, внесете пакета
# `crypto/sha512` и използвайте функцията му `sha512.New()`.

# Ако ви е нужен криптографски сигурен хеш, трябва да прочетете внимателно
# (https://en.wikipedia.org/wiki/Cryptographic_hash_function)!
