// _goroutine_[^goroutine] е лека нишка[^thread] на
// изпълнение.
// [^goroutine]: goroutine – измислена за езика Го дума, за да обозначи и разграничи вида нишки в този език от другите програмни езици – подзадача, изпълняваща се едновременно с главната.
// [^thread]: thread – нишка (за изпълнение на поредица от указания)

package main

import (
	"fmt"
	"time"
)

func f(from string) {
	for i := range 3 {
		fmt.Println(from, ":", i)
	}
}

func main() {

	// Да предположим, че извикваме функция `f(s)` по
	// обичайния начин - в потока на програмата ни.
	f("пряко извикване")

	// За да извикаме тази функция като отделна нишка в
	// Го, пишем `go f(s)`. Тази нова „гозадача“ ще се
	// изпълни едновременно с извикващата я (главната
	// нишка).
	go f("извикване в отделна go-нишка")

	// Можете да пуснете нова гозадача с безименна
	// функция.
	go func(msg string) {
		fmt.Println(msg)
	}("върви")

	// Двете ни извикани функции сега работят независимо
	// една от друга в отделни нишки (потоци) на
	// изпълнение. Изчакваме ги да завършат. По-мощен
	// подход е да ползваме [WaitGroup](waitgroups).
	time.Sleep(time.Second)
	fmt.Println("готово")
}
