# Когато пуснем тази програма, ще видим първо изхода от
# блокиращото извикване, след това изхода от две
# гозадачи. Изходът от гозадачите може да се смеси,
# защото са пуснати едновременно от двигателя за
# изпълнение[^runtime] на Го.
# [^runtime]: runtime – буквално „по време на изпълнение“. Това е програмен код, който става част от нашата програма и я управлява по време на изпълнение. спокойно да го преведем _изпълнение_ или _изпълнител_
$ go run goroutines.go
пряко извикване : 0
пряко извикване : 1
пряко извикване : 2
извикване в отделна go-нишка : 0
върви
извикване в отделна go-нишка : 1
извикване в отделна go-нишка : 2
готово

# В следващия пример ще разгледаме едно допълнение към
# гозадачите – канали.
