# Важно! За да работят примерите, трябва пѫтят, описан чрез `пѫтека` да сочи до
# съществуващ файл, така че създайте го, например така:
$ echo "ала" > /tmp/dat
$ echo "баланица" >> /tmp/dat
# Забележете, че внимаваме колко байта ще прочетем, защото българските букви,
# поради местонахожденията си в таблицата УНИКОД, чиито номера не могат да се
# вместят в един байт, са представени в UTF-8 чрез двубайтови
# последователности. Иначе просто ще имаме счупени букви. Проверете като
# промените броя байтове при някои четения..
$ go run reading-files.go 
ала
баланица
6 хапки: ала
3 хапки @ 6: 
б
3 хапки @ 6: 
б
9 хапки: ала
б

# А сега ще разгледаме писането във файлове.
