// Go поддържа _непроменливи_ [^constant] (стойности) от
// вида знак, низ, булева и числова стойности.
//
// [^constant]: constant – непроменлива стойност, константна величина

package main

import (
	"fmt"
	"math"
)

// `const` обявява непроменлива стойност.
const s string = "constant"

func main() {
	fmt.Println(s)

	// Изявлението[^statement] `const` може да се появява
	// също в тяло на функция.
	// [^statement]: statement – изявление
	const n = 500000000

	// В изрази за създаване на непроменливи може да се
	// извършват аритметични действия с променлива точност.
	const d = 3e20 / n
	fmt.Println(d)

	// Числовата непроменлива няма тип, докато не ѝ се
	// даде такъв. Например чрез изрично превръщане.
	fmt.Println(int64(d))

	// На число може да му се придаде вид при използването
	// му в определен смисъл, който изисква такъв вид
	// стойност. Например при присвояване на стойност на
	// променлива или извикване на функция. Тук `math.Sin`
	// очаква число от вида `float64`.
	fmt.Println(math.Sin(n))
}
