// Пакетът `strings` от стандартната библиотека предоставя
// много полезни функции за работа с низове. Ето някои
// примери, за да получите представа за съдържанието на
// пакета.

package main

import (
	"fmt"
	s "strings"
)

// Даваме по-кратко име на `fmt.Println`, защото ще го
// ползваме много долу.
var p = fmt.Println

func main() {

	// Това са някои от функциите в `strings`. Понеже това
	// са функции, а не методи на самия обект низ,
	// подаваме низ като първа податка на функцията. Ще
	// намерите още функции в документацията за пакета
	// [`strings`](https://pkg.go.dev/strings).
	p("Съдържа:       ", s.Contains("проба", "ро"))
	p("Брой:          ", s.Count("проба", "п"))
	p("ИмаПредставка: ", s.HasPrefix("проба", "пр"))
	p("ИмаНаставка:   ", s.HasSuffix("проба", "ба"))
	// Ще покаже от кой байт започва кирилското а
	p("Място:         ", s.Index("проба", "а"))
	p("Свържи:        ", s.Join([]string{"а", "б"}, "-"))
	p("Повтори:       ", s.Repeat("г", 5))
	p("Замести:       ", s.Replace("ала", "а", "0", -1))
	p("Замести:       ", s.Replace("ала", "а", "0", 1))
	p("Разцепи:       ", s.Split("а-б-в-г-д-е", "-"))
	p("ВМалки:        ", s.ToLower("ПРОБА"))
	p("ВГлавни:       ", s.ToUpper("проба"))
}
