$ go build command-line-subcommands.go 

# Първо извикайте подкомандата ала.
$ ./command-line-subcommands ала -включ -име=Краси бала ница
подкоманда 'ала'
  включ: true
  име: Краси
  още податки: [бала ница]

# Сега бала.
$ ./command-line-subcommands бала -равнище 8 ба ни ца
подкоманда 'бала'
  равнище: 8
  още податки: [ба ни ца]

# Но бала няма да приеме флаговете на ала.
$ ./command-line-subcommands бала -включ ни ца
flag provided but not defined: -включ
Usage of бала:
  -равнище int
    	равнище

# После ще разгледаме променливите на обкръжението, друг обичаен начин за
# подаване на данни към приложенията.
