// Променливите на обкръжението (работната среда)[^env] са всеобщ способ за предаване
// на сведнения за настройки в програмите в Юникс[^cfg]. Да видим как се
// задават, вземат и извеждат като списък променливите на средата.
// [^env]: environment variables – https://bg.wikipedia.org/wiki/Променлива\_на\_средата
// [^cfg]: Препоръчва се ползване на данни за настройки на програматa направо от средата. https://www.12factor.net/config

package main

import (
	"fmt"
	"os"
	"strings"
)

func main() {

	// За да създадем двойка ключ/стойност, ползваме функцията `os.Setenv`. За
	// да вземем стойност за даден ключ, ползваме `os.Getenv`. Ако ключът не
	// съществува, ще получим празен низ.
	os.Setenv("FOO", "1")
	fmt.Println("FOO:", os.Getenv("FOO"))
	fmt.Println("BAR:", os.Getenv("BAR"))

	// Функцията `os.Environ` връща резен от низове, предствляващи двойки
	// `КЛЮЧ=стойност`. Можете да ползвате `strings.SplitN` за да ги разделите.
	// Тук извеждаме списък с всички ключове (имена) на променливи от текущото
	// `Exec` изисква податките да са във вид на резен (а не един голям низ).
	fmt.Println()
	for _, e := range os.Environ() {
		pair := strings.SplitN(e, "=", 2)
		fmt.Println(pair[0])
	}
}
