# За да пуснете програмата, поставете изходния код в
# `hello-world.go` и на командния ред напишете `go run`,
# след което натиснете клавиша ⏎ (Enter/Return).
$ go run hello-world.go
hello world

# По-често ще искаме да изградим програмата като
# двоично-изпълним файл. Това можем да направим с помощта
# на `go build`.
$ go build hello-world.go
$ ls
hello-world	hello-world.go

# След това можем да изпълним направо двоичния файл.
$ ./hello-world
hello world

# Сега, след като можем да пускаме и изграждаме прости
# програми на Го, нека научим повече за езика.
