// Go има вградена поддръжка за _връщане на множество
// стойности_ от функция. Тази способност на езика често
// се използва в присъщия на Го стил, например за да се
// върне едновременно стойност и грешка.

package main

import "fmt"

// Изявлението `(int, int)` в заглавието[^signature] на
// тази функция указва, че функцията връща две цели числа.
// [^signature]: signature – буквално подпис; в случая – заглавие. Програминят код между фигурните скоби пък е тяло на функцията.
func vals() (int, int) {
	return 3, 7
}

func main() {

	// Тук ползваме двете различни върнати стойности чрез
	// _множестено присвояване_.
	a, b := vals()
	fmt.Println(a)
	fmt.Println(b)

	// Ако искате само някои от върнатите стойности,
	// използвайте празното име `_` за тези, които не ви
	// трябват.
	_, c := vals()
	fmt.Println(c)
}
