// Go поддържа _безименни функции_[^безименни], които
// могат да създават затваряния[^затваряне].
//
// Безименните функции са полезни, когато искате да
// създадете функция „посред“[^inline] написаното, без да
// е нужно да я именувате.
// [^безименни]: annonimous function – безименна функция. https://bg.wikipedia.org/wiki/Анонимна_функция
// [^затваряне]: closure – затваряне. https://bg.wikipedia.org/wiki/Затваряне_(информатика)
// [^inline]: inline – насред, посред, в реда на...

package main

import "fmt"

// Функцията `intSeq` връща друга функция, която създаваме
// без име в тялото на `intSeq`. Върната функция _затваря
// в себе си_ променливата `i` и така създава _затвор_ за
// `i`.
func intSeq() func() int {
	i := 0
	return func() int {
		i++
		return i
	}
}

func main() {

	// Извикваме `intSeq`, като присвояваме изхода ѝ
	// (функция) на променливата `nextInt`. Тази
	// стойност-функция прихваща _своя собствена_ стойност
	// на `i`, която стойност се променя при всяко
	// извикване на `nextInt`.
	nextInt := intSeq()

	// Вижте действието на затварянето от извикването на
	// `nextInt` няколко пъти.
	fmt.Println(nextInt())
	fmt.Println(nextInt())
	fmt.Println(nextInt())

	// За да потвърдим, че състоянието на `i` е
	// собственост на новопроизведената функция, създайте
	// и извикайте нова.
	newInts := intSeq()
	fmt.Println(newInts())
}
