// В предишния пример разгледахме [създаването на външни
// процеси](spawning-processes). Това го правим, когато искаме да имаме външен
// процес, който да достъпваме от работещ Го процес. Понякога пък искаме
// напълно да заместим текущия процес с друг, може би не написан на Го. За да
// направим това, ще ползваме класическата функция `exec`[^exec], както е
// осъществена в Го.
// [^exec]: exec – https://en.wikipedia.org/wiki/Exec_(system_call)

package main

import (
	"os"
	"os/exec"
	"syscall"
)

func main() {

	// В нашия случай ще изпълним юникс командата `ls`. Го изисква абсолютен
	// пѫт до изпълнимия файл, затова ползваме `exec.LookPath` да го намерим
	// (може би `/bin/ls`).
	binary, lookErr := exec.LookPath("ls")
	if lookErr != nil {
		panic(lookErr)
	}

	// `Exec` изисква податките да са във вид на резен (а не един голям низ).
	// Ще подадем на `ls` някои обичайни. Забележете че първият член на
	// резена е името на програмата.
	args := []string{"ls", "-a", "-l", "-h"}

	// На функцията `Exec` са ѝ нужни и [променливи на
	// обкръжението](environment-variables). Тук просто вземаме текущото
	// обкръжение.
	env := os.Environ()

	// А това е самото извикване на `syscall.Exec`. Ако извикването е успешно,
	// изпълнението на текущия процес ще приключи тук и ще бъде заместен  от
	// процеса `/bin/ls -a -l -h`. Ако новият процес върне грешка, взимаме я и
	// се ужасяваме.
	execErr := syscall.Exec(binary, args, env)
	if execErr != nil {
		panic(execErr)
	}
}
