# Като пуснем програмата виждаме, че при основаното на
# гозадачи управление на състоянието, тя извършва (на
# моето сметало) общо 73732 действия.
$ go run stateful-goroutines.go
Общо четения: 66790
Общо писания: 6942

# Точно в този случай подходът, основан на гозадачи беше
# малко по-сложен от основаващия се на превключватели. Все
# пак може да е полезно в някои случаи. Например когато
# работите с други канали или когато използването на
# превключватели, може да доведе до повече грешки.
# Използвайте подхода, който ви изглежда по-естествен,
# особено с оглед на по-лесното разбиране, дали програмата
# ви работи правилно.
