// Флаговете на командния ред са обичаен начин за указване на възможности за
// избор (на податки със и без стойности) за изпълнение на програми. Например в
// случая с `wc -l` `-l` е флаг за командния ред.

package main

// Го предоставя стандартния пакет `flag` за разбор на прости флагове. Ще
// ползваме този пакет, за осъществяване на наша си програма, която
// взаимодейства с командния ред.
import (
	"flag"
	"fmt"
)

func main() {

	// Можете да обявявате прости флагове за вход на низове, цели числа и
	// булеви стойности. Тук обявяваме флага `дума` със стойност по
	// подразбиране `"алабала"` и кратко описание. Функцията `flag.String`
	// връща указател към низ (не стойност низ). По-долу ще видим как се ползва
	// указателя.
	wordPtr := flag.String("дума", "алабала", "приема низ")

	// Следното изявление обявява флаговете `numb` и `fork`, подобно на флага
	// `дума`.
	numbPtr := flag.Int("numb", 42, "an int")
	forkPtr := flag.Bool("fork", false, "a bool")

	// Също така е възможно да обявим избор на стойност, който използва вече
	// съществуваща променлива, обявена по-рано в програмата. Забележете, че
	// трябва да подадем указател при обявяването на флага.
	var svar string
	flag.StringVar(&svar, "svar", "bar", "a string var")

	// След като сме обявили всички флагове, трябва да извикаме `flag.Parse()`,
	// за да разложим командния ред в обявените от нас променливи.
	flag.Parse()

	// Тук просто ще изведем обратно разложените стойности и всички оставащи
	// податки. Забележете, че трябва да достъпим източниците на данните, към
	// които сочат указателите с помощта на звезда, например `*wordPtr`, за да
	// достигнем до самите стойности.
	fmt.Println("дума:", *wordPtr)
	fmt.Println("numb:", *numbPtr)
	fmt.Println("fork:", *forkPtr)
	fmt.Println("svar:", svar)
	fmt.Println("tail:", flag.Args())
}
