# Очакваме програмата ни да изведе на екрана точно 50000 –
# броят извършени действия – увеличаване с единица. Ако
# бяхме използвали обикновено – не неделимо число, щяхме
# да видим друго число, което щеше даже да е различно при
# всяко пускане на програмата Причината щеше да се състои
# в това, че няколко гозадачи щяха да виждат една и съща
# стойност на числото едновременно. Също щяхме да получим
# и предупреждения за „съревнование“ (race), ако пуснехме
# програмата с флаг `-race`.
$ go run atomic-counters.go
действия: 50000

# В следващия пример ще разгледаме _взаимното изключване_
# – друг способ за управление на състояние.
