# Забележете, че въпреки че отрязъците са различен вид
# данни от поредиците, те биват показвани по същия начин
# от `fmt.Println`.
$ go run slices.go
неначенат: [] true true
празен: [  ] len: 3 cap: 3
задаваме: [a b c]
взимаме: c
len: 3
добавено: [a b c d e f]
copy: [a b c d e f]
sl1: [c d e]
sl2: [a b c d e]
sl3: [c d e f]
обявление: [g h i]
t == t2
2d:  [[0] [1 2] [2 3 4]]

# Прегледайте следната [прекрасна
# статия](https://go.dev/blog/slices-intro) от
# разработчиците на Go, за да научите повече подробности
# как са осъществени отрязъците в Go.

# Сега, след като разгледахме поредиците и отрязъците, ще
# видим и другата вградена в Го структура от данни –
# картите.
