// Подаването на данни на командния ред[^cli] е обичаен начин за изпълнение на
// програми с различни входни данни. Например при изпълнението на `go run
// hello.go` `run` и `hello.go` са податки (данни, подадени на командния ред)
// на програмата `go`.
// [^cli]: command-line interface – взаимодействие чрез команден ред https://bg.wikipedia.org/wiki/Интерфейс_с_команден_ред

package main

import (
	"fmt"
	"os"
)

func main() {

	// Отрязъкът `os.Args` съдържа суровите данни, подадени на командния
	// ред[^sep]. Забележете, че първата стойност в отрязъка е пълният пѫт до
	// програмата, а `os.Args[1:]` (всички останали стойности) са податките към
	// програмата.
	// [^sep]: Разделител за данните е празното пространство между тях.

	argsWithProg := os.Args
	argsWithoutProg := os.Args[1:]

	// Можете да ползвате отделните податки като укажете мястото им в отрязъка.
	arg := os.Args[3]

	fmt.Println(argsWithProg)
	fmt.Println(argsWithoutProg)
	fmt.Println(arg)
}
