// Ползвайте функцията `os.Exit` за да излезете незабавно с дадено състояние.
package main

import (
	"fmt"
	"os"
)

func main() {

	// Изявленията `defer`[^defer] _няма_ да се изпълнят след като сме извикали `os.Exit`,
	// сирѣч това извикване на  `fmt.Println` няма да се случи.
	// [^defer]: defer – отложѝ. Изявлението `defer` добавя извикване на функция към отделен списък за съдържащата го функция. Този списък със запазени извиквания се изпълнява, след като съдържащата го  функция приключи изпълнението си. `defer` обикновено се използва, за да опрости функции, които извършват различни действия по почистване. Всяка функция може да съдържа множество отложени извиквания (изявления `defer`). `defer` е ключова дума в Го и не може да се ползва като име.
	defer fmt.Println("!")

	// Изход със състояние 3.
	os.Exit(3)
}

// Забележете, че за разлика от C, Го не връща цяло число при излизане от
// `main`, за да обозначи състояние при изход. Ако желаете да излезете с
// ненулево състояние, трябва да извикате `os.Exit` и да му подадете цяло
// положително число, за да обозначите състоянието на програмата ви при изход.
