// Пакетът `slices` в Го осъществява подреждане за
// вградени и за създадени от потребителя видове
// данни. Първо ще разгледаме вградените видове.

package main

import (
	"fmt"
	"slices"
)

func main() {

	// Функциите за подреждане са _обобщени_ и работят с
	// всеки _подреден_ вграден вид. За да видите списък с
	// подредените видове, погледнете
	// [cmp.Ordered](https://pkg.go.dev/cmp#Ordered).
	strs := []string{"c", "a", "b"}
	slices.Sort(strs)
	fmt.Println("Низове:     ", strs)

	// Пример с подреждане на стойности от вида `int`.
	ints := []int{7, 2, 4}
	slices.Sort(ints)
	fmt.Println("Цели числа: ", ints)

	//  Можем да ползваме пакета `slices` и за да
	//  проверим, дали един отрязък е вече подреден.
	s := slices.IsSorted(ints)
	fmt.Println("Подреден:   ", s)
}
