// Го предлага разширена поддръжка за работа с време и
// продължителност. Ето някои примери.

package main

import (
	"fmt"
	"time"
)

func main() {
	p := fmt.Println

	// Да видим как се взема текущото време.
	сега := time.Now()
	p(сега)

	// Можете да изградите структура за `time` като
	// предоставите година, месец, ден и т.н. Времената са
	// винаги свързнаи с място времева област `Location`.
	тогава := time.Date(
		2009, 11, 17, 20, 34, 58, 651387237, time.UTC)
	p(тогава)

	// Както бихте очаквали, можете да извлечете отделните
	// части.
	p(тогава.Year())
	p(тогава.Month())
	p(тогава.Day())
	p(тогава.Hour())
	p(тогава.Minute())
	p(тогава.Second())
	p(тогава.Nanosecond())
	p(тогава.Location())

	// Дните от седмицата са също налични чрез метода `Weekday`.
	p(тогава.Weekday())

	// Тези методи сравняват две точки във времето, като
	// проверяват дали първата се намира преди, след или в
	// същото време с втората.
	p(тогава.Before(сега))
	p(тогава.After(сега))
	p(тогава.Equal(сега))

	// Методът `Sub` (от subtract изваждам) връща
	// стойност от вид `Duration` (продължителност),
	// представляваща разликата между две точки във
	// времето.
	разлика := сега.Sub(тогава)
	p(разлика)

	// Можем да сметнем размера на продължителността в
	// различни мерни единици.
	p(разлика.Hours())
	p(разлика.Minutes())
	p(разлика.Seconds())
	p(разлика.Nanoseconds())

	// Можем да използваме `Add` (добавям), за да отидем
	// напред във времето с определена продължителност,
	// или да добавим време с отрицателен знак, за да
	// отидем назад.
	p(тогава.Add(разлика))
	p(тогава.Add(-разлика))
}
