# Като пуснем програмата виждаме, че заявките от първата
# поредица биват обработени по една на 200 милисекунди,
# както искахме.
$ go run rate-limiting.go
заявка 1 10:35.357
заявка 2 10:35.557
заявка 3 10:35.757
заявка 4 10:35.957
заявка 5 10:35.157
# При втората поредица от заявки, обслужваме първите три
# незабавно, понеже сме разрешили скок на ставката.
# Следващите две обработваме със забавяне от по 200
# милисекунди за всяка.
заявки 1 10:35.158
заявки 2 10:35.158
заявки 3 10:35.158
заявки 4 10:35.358
заявки 5 10:35.558
