// В Go, _променливите_ (стойности) се обявяват изрично и
// се ползват от компилатора, за да провери правилността
// на вида им при извикване на функиции и т.н.

package main

import "fmt"

func main() {

	// `var` обявява една или повече променливи.
	var a = "initial"
	fmt.Println(a)

	// Можете да обявите няколко променливи наведнъж.
	var b, c int = 1, 2
	fmt.Println(b, c)

	// Go отгатва типа на наченатите (инициализирани)
	// променливи.
	var d = true
	fmt.Println(d)

	// Промнеливите, които са само обявени, без да са
	// наченати (да им е присвоена начална стойност),
	// получават съответна за вида _нулева стойност_.
	// Например нулевата стойност за цяло число `int` е 0.
	var e int
	fmt.Println(e)

	// В този случай например, правописът[^syntax] `:=` е
	// кратък начин за обявяване и начеване вместо
	// `var f string = "apple"`. Този кратък правопис може
	// да се използва само във функции.
	//  [^syntax]: syntax – правило за писане – правопис
	f := "apple"
	fmt.Println(f)
}
