// _Каналите_ са тръбите, които свързват едновременно
// работещи гозадачи. Можете да изпращате стойности през
// канали от една задача и да ги получавате в друга
// гозадача.

package main

import "fmt"

func main() {

	// Създайте нов канал с `make(chan видСтойност)`.
	// Видът на канала е видът, който каналът пренася.
	messages := make(chan string)

	// _Изпратете_ стойност по канал, като напишете
	// `имеНаКанал <-`. Тук пращаме `"пинг"` по
	// канала `messages`, който създадохме горе, от нова
	// гозадача.
	go func() { messages <- "пинг" }()

	// Като напишем `<-channel` означва, че _получаваме_
	// стойност по канала. Тук ще получим съобщението
	// `"пинг"`, което изпратихме горе и ще го изведем на
	// екрана.
	msg := <-messages
	fmt.Println(msg)
}
