# Ако пуснем тази програма, тя ще се ужаси, ще изведе
# грешка и проследяване на гозадачата, в която се е
# случило това, след което ще излезе с ненулево състояние.


# Когато програмата достигне до извикването на първата
# `panic` в `main`, програмата излиза, без да изпълни
# остатъка от кода. Ако искате да видите, как програмата
# се опитва да създаде временен файл, коментирайте първото
# извикване на `panic`.
$ go run panic.go
panic: препятствие!
goroutine 1 [running]:
main.main()
	/home/berov/opt/dev/gobyexample/examples/panic/panic.go:20 +0x25
exit status 2
...

# Забележете, че за разлика от някои езици, ползващи
# изключения[^except] за управление на много грешки в Го е
# прието да се връща стойност от вида данни за грешки
# `error`, като така се обозначават състояния, които
# могат да бъдат обработени и програмта да продължи.
# `panic` се извиква, когато няма смисъл програмата да
# продължава или няма как да продължи след тази грешка.
# [^except]: exception – изключение. В Java това е ключова дума, част от езика. В Python ключовата дума е except.
