// Ужасът (`panic`) обикновено настъпва, когато се случи
// нещо неочаквано лошо. Използва се най-често, за бързо
// приключване на програмата при неочаквана грешка,
// която не би трябвало да настъпи при обичайното
// изпълнение, или не сме готови да обработим
// благополучно.

package main

import (
	"os"
	"path/filepath"
)

func main() {

	// Ще ползваме `panic` в този сайт, за да проверяваме
	// за неочаквани грешки. Това е единствената програма
	// в сайта, направена да се ужаси.
	panic("препятствие!")

	// `panic` обичайно ползваме да прекратим изпълнението
	// на функция, ако тя върне стойност, която не знаем
	// какво да правим или как да обработим. Ето пример
	// как се ужасяваме, ако получим неочаквана грешка
	// при създаване на файл.
	path := filepath.Join(os.TempDir(), "file")
	_, err := os.Create(path)
	if err != nil {
		panic(err)
	}
}
